#+title: Leetcode
#+startup: show2levels

** 解法1:暴力枚举
#+begin_src cpp :results output :includes '(<vector> <iostream>) :main no :namespaces std
vector<int> twoSum(vector<int>& nums, int target){
    int i,j;
    for(i=0; i < nums.size()-1; ++i){
        for(j=i+1; j < nums.size(); ++j){
            if(nums[i]+nums[j] == target){
                return {i,j};
            }
        }
    }
    return {};
}

int main(){
    vector<int> nums = {2,4,6,7};
    int target = 9;
    vector<int> vec = twoSum(nums, target);
    for (auto v : vec){
        cout << v << endl;
    }
}

#+end_src

#+RESULTS:
: 0
: 3

** 解法1:排序
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_map>) :main no :namespaces std
vector<vector<string>> groupAnagrams(vector<string>& strs) {
    unordered_map<string, vector<string>> mp;
    for(auto& str:strs){
        string key = str;
        sort(key.begin(), key.end());
        mp[key].emplace_back(str);
    }

    vector<vector<string>> ans;
    for(auto it=mp.begin(); it!=mp.end(); ++it){
        ans.emplace_back(it->second);
    }
    return ans;
}

int main(){
    vector<string> strs = {"eat", "tea", "tan", "ate", "nat", "bat"};
    auto ga = groupAnagrams(strs);
    for(auto& g:ga){
        for(auto& s:g){
            cout << s << endl;
        }
    }
}
#+end_src

#+RESULTS:
: bat
: tan
: nat
: eat
: tea
: ate
** 解法2:ASCII码作为hash map的key
- 思路 :: 将26个字母通过[[id:bc0b7272-ae2a-43e6-9727-0992493ddc04][ASCII]]映射到string，string为26个数字组成；将string作为hash map的key，以此分组
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_map>) :main no :namespaces std
class Solution {
public:
vector<vector<string>> groupAnagrams(vector<string>& strs) {
    vector<vector<string>> res;
    unordered_map<string, vector<string>> u_mapRes;
    for(auto& str:strs){
        string count(26, 0);
        for(auto& c:str){
            count[c-'a'] += 1;
        }
        u_mapRes[count].push_back(str);
    }
    for(auto& pair:u_mapRes){
        res.push_back(pair.second);
    }
    return res;
}
};

int main(){
    vector<string> strs = {"eat", "tea", "tan", "ate", "nat", "bat"};
    Solution sol;
    auto ga = sol.groupAnagrams(strs);
    for(auto& g:ga){
        for(auto& s:g){
            cout << s << endl;
        }
    }
}
#+end_src

#+RESULTS:
: bat
: tan
: nat
: eat
: tea
: ate
** 解法1:unordered_set
- 思路 :: 遍历数组，通过左边数是否存在判断是否为序列开始；通过判断右边是否存在持续更新数组长度
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    int longestConsecutive(vector<int>& nums) {
        int max_len = 0;
        unordered_set<long long> u_set;
        for(int i = 0; i < nums.size(); ++i){
            u_set.emplace(nums[i]);
        }
        for(auto& num:u_set){
            if(u_set.find(num - 1) == u_set.end()){
                int len = 0;
                while(u_set.find(num + len) != u_set.end()){
                    ++len;
                    max_len = max(max_len, len);
                }
            }
        }
        return max_len;
    }
};

int main(){
    vector<int> nums = {0,3,7,2,5,8,4,6,0,1};
    Solution sol;
    cout << sol.longestConsecutive(nums) << endl;
}
#+end_src

#+RESULTS:
: 9
** 解法1:双指针
- 思路 :: 右指针遍历，遇到0元素移动；遇到非0元素与左指针交换，左指针移动一个元素
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    void moveZeroes(vector<int>& nums) {
        int left = 0;
        for(int right = 0; right < nums.size(); ++right){
            if(nums[right]){
                int tmp = nums[right];
                nums[right] = nums[left];
                nums[left] = tmp;
                ++left;
            }
        }
    }
};

int main(){
    vector<int> nums = {0,1,0,3,12};
    Solution sol;
    sol.moveZeroes(nums);
    for(auto& num:nums){
        cout << num << endl;
    }
}
#+end_src

#+RESULTS:
: 1
: 3
: 12
: 0
: 0

** 解法1:双指针
- 思路 :: 指针在数组两端，只有移动指针值小的，面积才可能变大；因此指针移动策略为移动指针值小的那端指针
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    int maxArea(vector<int>& height) {
        int L = 0, R = height.size() - 1;
        int max_area = 0;
        while (L < R){
            int area = (R - L) * min(height[L], height[R]);
            max_area = max(max_area, area);
            if (height[L] < height[R]){
                ++L;
            } else {
                --R;
            }
        }
        return max_area;
    }
};

int main(){
    vector<int> height = {1,8,6,2,5,4,8,3,7};
    Solution sol;
    cout << sol.maxArea(height) << endl;
}
#+end_src

#+RESULTS:
: 49

** 解法1:双指针
- 思路 :: 排序数字；第一个数从左到右遍历(需去重)；同时第二、三个数用双指针控制，第二个数向第三个数遍历，期间三数之和相加结果符合要求，就放入结果数组；相加结果小了，移动第二个数的指针；大了，移动第三个数的指针
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    vector<vector<int>> threeSum(vector<int>& nums) {
        vector<vector<int>> res;
        sort(nums.begin(), nums.end());
        for (int a = 0; a < nums.size(); ++a){
            if (a > 0 && nums[a] == nums[a - 1]){
                continue;
            }
            int left = a + 1, right = nums.size() - 1;
            while (left < right) {
                if (nums[a] + nums[left] + nums[right] == 0){
                    res.push_back({nums[a], nums[left], nums[right]});
                    ++left;
                    while (left < right && nums[left - 1] == nums[left]){
                        ++left;
                    }
                } else if (nums[a] + nums[left] + nums[right] < 0) {
                    ++left;
                } else {
                    --right;
                }
            }
        }
        return res;
    }
};

int main(){
    vector<int> nums = {-1,0,1,2,-1,-4};
    Solution sol;
    auto vec = sol.threeSum(nums);
    for (auto& v:vec) {
        for (auto& vv:v) {
            cout << vv << endl;
        }
    }
}
#+end_src

#+RESULTS:
: -1
: -1
: 2
: -1
: 0
: 1

** 解法1:双指针
- 思路 :: 每一个点能存储雨水的量取决于 该点左右较大边界中较小的一个 与自身的差值；根据木桶效应，左右边界中较小的一方移动，移动过程中更新自身的值，并与当前点的差值更新总的雨水量
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    int trap(vector<int>& height) {
        int res = 0;
        int left = 0, right = height.size() - 1;
        int maxL = height[left], maxR = height[right];
        while (left < right) {
            if (maxL < maxR) {
                ++left;
                maxL = max(maxL, height[left]);
                res += (maxL - height[left]);
            } else {
                --right;
                maxR = max(maxR, height[right]);
                res += (maxR - height[right]);
            }
        }
        return res;
    }
};

int main(){
    Solution sol;
    vector<int> height = {0,1,0,2,1,0,1,3,2,1,2,1};
    cout << sol.trap(height) << endl;
}

#+end_src

#+RESULTS:
: 6

** 解法1:滑动窗口
- 思路 :: 右边界遍历一遍，不重复的元素加入窗口，重复的元素从左边界删除
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    int lengthOfLongestSubstring(string s) {
        unordered_set<char> u_set;
        int res = 0;
        int cur_window = 0;
        for (int left = 0, right = 0; right < s.length(); ++right) {
            while (left < right && u_set.count(s[right])) {
                u_set.erase(s[left]);
                ++left;
                --cur_window;
            }
            u_set.insert(s[right]);
            ++cur_window;
            res = max(res, cur_window);
        }
        return res;
    }
};

int main(){
    Solution sol;
    string s = "pwwkew";
    cout << sol.lengthOfLongestSubstring(s) << endl;
}
#+end_src

#+RESULTS:
: 3

** 解法1:滑动窗口
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    vector<int> findAnagrams(string s, string p) {
        vector<int> res;
        if (s.size() < p.size()) {
            return res;
        }
        vector<int> counts(26);
        for (int i = 0; i < p.size(); ++i) {
            ++counts[p[i] - 'a'];
        }
        vector<int> curCounts(26);
        for (int i = 0; i < p.size() - 1; ++i) {
            ++curCounts[s[i] - 'a'];
        }
        for (int left = 0, right = p.size() - 1; right < s.size(); ++left, ++right) {
            ++curCounts[s[right] - 'a'];
            if (counts == curCounts) {
                res.push_back(left);
            }
            --curCounts[s[left] - 'a'];
        }
        return res;
    }
};

int main(){
    Solution sol;
    string s = "cbaebabacd", p = "abc";
    vector<int> resVec = sol.findAnagrams(s, p);
    for (auto& res:resVec) {
        cout << res << endl;
    }
}
#+end_src

#+RESULTS:
: 0
: 6

** 解法1:[[id:aa4d00a0-0fa0-453f-826e-56d34b4fe5ed][前缀和数组]]+哈希表
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_map>) :main no :namespaces std
class Solution {
public:
    int subarraySum(vector<int>& nums, int k) {
        int res = 0;
        unordered_map<int, int> u_map;
        int cur_sum = 0;
        u_map[cur_sum] = 1;
        for (int i = 0; i < nums.size(); ++i) {
            cur_sum += nums[i];
            if (u_map[cur_sum - k]) {
                res += u_map[cur_sum - k];
            }

            u_map[cur_sum] += 1;
        }
        return res;
    }
};

int main(){
    Solution sol;
    vector<int> nums = {1,2,3};
    int k = 3;
    cout << sol.subarraySum(nums, k) << endl;
}

#+end_src

#+RESULTS:
: 2

** 解法1:单调队列
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <deque>) :main no :namespaces std
class Solution {
private:
    class MyQueue {
        deque<int> que;
    public:
        void pop(int value) {
            if (!que.empty() && value == que.front()) {
                que.pop_front();
            }
        }
        void push(int value) {
            while (!que.empty() && value > que.back()) {
                que.pop_back();
            }
            que.push_back(value);
        }

        int front() {
            return que.front();
        }
    };
public:
    vector<int> maxSlidingWindow(vector<int>& nums, int k) {
        MyQueue que;
        vector<int> res;
        for (int i = 0; i < k; ++i) {
            que.push(nums[i]);
        }
        res.push_back(que.front());
        for (int i = k; i < nums.size(); ++i) {
            que.pop(nums[i - k]);
            que.push(nums[i]);
            res.push_back(que.front());
        }
        return res;
    }
};

int main() {
    Solution sol;
    vector<int> nums = {1,3,-1,-3,5,3,6,7};
    int k = 3;
    vector<int> res = sol.maxSlidingWindow(nums, k);
    for (auto& r:res) {
        cout << r << " ";
    }
}
#+end_src

#+RESULTS:
: 3 3 5 5 6 7

** 解法1:枚举所有子数组的最后一个元素
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    int maxSubArray(vector<int>& nums) {
        int maxSub = nums[0];
        int curSum = 0;
        for (int i = 0; i < nums.size(); ++i) {
            if (curSum < 0) {
                curSum = 0;
            }
            curSum += nums[i];
            maxSub = max(maxSub, curSum);
        }
        return maxSub;
    }
};

int main() {
    Solution sol;
    vector<int> nums = {-2,1,-3,4,-1,2,1,-5,4};
    cout << sol.maxSubArray(nums);
}
#+end_src

#+RESULTS:
: 6

** 解法1:排序
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    vector<vector<int>> merge(vector<vector<int>>& intervals) {
        vector<vector<int>> res;
        if (intervals.size() == 0)
            return res;
        sort(intervals.begin(), intervals.end(), [](const vector<int>& interval1, const vector<int>& interval2){
            return interval1[0] < interval2[0];
        });

        int tempStart = intervals[0][0];
        int tempEnd = intervals[0][1];

        for (int i = 0; i < intervals.size(); ++i) {
            if (tempEnd >= intervals[i][0]) {
                tempEnd = max(tempEnd, intervals[i][1]);
            } else {
                res.push_back({tempStart, tempEnd});
                tempStart = intervals[i][0];
                tempEnd = intervals[i][1];
            }
        }
        res.push_back({tempStart, tempEnd});
        return res;
    }
};

int main() {
    Solution sol;
    vector<vector<int>> intervals = {{1,3},{2,6},{8,10},{15,18}};
    auto resNums = sol.merge(intervals);
    for (auto& res:resNums) {
        for (auto& r:res) {
            cout << r << " ";
        }
        cout << endl;
    }
}
#+end_src

#+RESULTS:
: 1 6
: 8 10
: 15 18

** 解法1:多次反转
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    void rotate(vector<int>& nums, int k) {
        k = k % nums.size();
        reverse(nums, 0, nums.size() - 1);
        reverse(nums, 0, k - 1);
        reverse(nums, k, nums.size() - 1);
    }

    void reverse(vector<int>& nums, int left, int right) {
        while (left < right) {
            int temp = nums[left];
            nums[left] = nums[right];
            nums[right] = temp;
            ++left;
            --right;
        }
    }
};

int main() {
    Solution sol;
    vector<int> nums = {1,2,3,4,5,6,7};
    int k = 3;
    sol.rotate(nums, k);
    for (auto& num:nums) {
        cout << num << " ";
    }
}
#+end_src

#+RESULTS:
: 5 6 7 1 2 3 4

** 解法1:[[id:d4215449-8882-47a2-90af-c9f3b929f1f1][前缀积]]
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    vector<int> productExceptSelf(vector<int>& nums) {
        vector<int> res(nums.size(), 1);
        int prefix = 1;
        for (int i = 0; i < nums.size(); ++i) {
            res[i] = prefix;
            prefix = prefix * nums[i];
        }

        int postfix = 1;
        for (int j = nums.size() - 1; j >= 0; --j) {
            res[j] = res[j] * postfix;
            postfix = postfix * nums[j];
        }
        return res;
    }
};

int main() {
    Solution sol;
    vector<int> nums = {1,2,3,4};
    auto resNums = sol.productExceptSelf(nums);
    for (auto& res:resNums) {
        cout << res << " ";
    }
}
#+end_src

#+RESULTS:
: 24 12 8 6

** 解法1:交换元素到本应该在的位置
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
using namespace std;

class Solution {
public:
    int firstMissingPositive(vector<int>& nums) {
      for (int i = 0; i < nums.size(); ++i){
        while (nums[i] > 0 && nums[i] <= nums.size() && nums[i] != i+1 && nums[nums[i]-1] != nums[i]) {
            swap(nums, i, nums[i]-1);
        }
      }
      for (int i = 0; i < nums.size(); ++i){
        if (nums[i]!=i+1){
            return i+1;
        }
      }
      return nums.size()+1;
    }

    void swap(vector<int>& nums, int i, int j){
        int tmp = nums[i];
        nums[i] = nums[j];
        nums[j] = tmp;
    }
};

int main() {
    Solution sol;
    vector<int> nums = {3,4,-1,1};
    cout << sol.firstMissingPositive(nums);
}
#+end_src

#+RESULTS:
: 2

** 解法1:
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    void setZeroes(vector<vector<int>>& matrix) {
     int rows = matrix.size();
     int cols = matrix[0].size();
     int zeroRow = 1;
     for (int row = 0; row < rows; ++row) {
        for (int col =0; col < cols; ++col) {
            if (matrix[row][col] == 0) {
                matrix[0][col] = 0;
                if (row > 0) {
                    matrix[row][0] = 0;
                } else {
                    zeroRow = 0;
                }
            }
        }
     }
     for (int row = 1; row < rows; ++row) {
        for (int col = 1; col < cols; ++col) {
            if (matrix[row][0] == 0 || matrix[0][col] == 0) {
                matrix[row][col] = 0;
            }
        }
     }
     if (matrix[0][0] == 0) {
        for (int row = 1; row < rows; ++row) {
            matrix[row][0] = 0;
        }
     }
     if (zeroRow == 0) {
        for (int col = 0; col < cols; ++col) {
            matrix[0][col] = 0;
        }
     }
    }
};

int main() {
    Solution sol;
    vector<vector<int>> matrix = {{1,1,1},{1,0,1},{1,1,1}};
    sol.setZeroes(matrix);
    for (auto& row:matrix) {
        for (auto& col:row ) {
            cout << col << " ";
        }
        cout << endl;
    }
}
#+end_src

#+RESULTS:
: 1 0 1
: 0 0 0
: 1 0 1

** 解法1:设置、移动矩阵边界
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    vector<int> spiralOrder(vector<vector<int>>& matrix) {
        int left = 0, right = matrix[0].size(), top = 0, bottom = matrix.size();
        vector<int> res;
        while (left < right && top < bottom) {
            for (int i = left; i < right; ++i) {
                res.push_back(matrix[top][i]);
            }
            ++top;
            if (top >= bottom) {
                break;
            }
            for (int j = top; j < bottom; ++j) {
                res.push_back(matrix[j][right - 1]);
            }
            --right;
            if (left >= right) {
                break;
            }
            for (int k = right - 1; k >= left; --k) {
                res.push_back(matrix[bottom - 1][k]);
            }
            --bottom;
            if (top >= bottom) {
                break;
            }
            for (int l = bottom - 1; l >= top; --l) {
                res.push_back(matrix[l][left]);
            }
            ++left;
        }
        return res;
    }
};

int main() {
    Solution sol;
    vector<vector<int>> matrix = {{1,2,3,4},{5,6,7,8},{9,10,11,12}};
    auto resMatrix = sol.spiralOrder(matrix);
    for (auto& res:resMatrix) {
        cout << res << " ";
    }
}
#+end_src

#+RESULTS:
: 1 2 3 4 8 12 11 10 9 5 6 7

** 解法1:设置、移动矩阵边界
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    void rotate(vector<vector<int>>& matrix) {
        int left = 0, right = matrix.size() - 1;
        while (left < right) {
            for (int i = 0; i < right - left; ++i) {
                int top = left, bottom = right;
                int topleft = matrix[top][left + i];
                matrix[top][left + i] = matrix[bottom - i][left];
                matrix[bottom - i][left] = matrix[bottom][right - i];
                matrix[bottom][right - i] = matrix[top + i][right];
                matrix[top + i][right] = topleft;
            }
            ++left;
            --right;
        }
    }
};

int main() {
    Solution sol;
    vector<vector<int>> matrix = {{5,1,9,11},{2,4,8,10},{13,3,6,7},{15,14,12,16}};
    sol.rotate(matrix);
    for (auto& rows:matrix) {
        for (auto& rol:rows) {
            cout << rol << " ";
        }
        cout << endl;
    }
}
#+end_src

#+RESULTS:
: 15 13 2 5
: 14 3 4 1
: 12 6 8 9
: 16 7 10 11

** 解法1:缩小搜索范围
- 思路 ::
#+begin_src cpp :results output :includes '(<vector> <iostream> <algorithm> <unordered_set>) :main no :namespaces std
class Solution {
public:
    bool searchMatrix(vector<vector<int>>& matrix, int target) {
       if (matrix.size() == 0 || matrix[0].size() == 0) {
        return false;
       }
       int row = 0, col = matrix[0].size() - 1;
       while (row < matrix.size() && col >= 0) {
        if (matrix[row][col] == target) {
            return true;
        } else if (matrix[row][col] > target) {
            --col;
        } else {
            ++row;
        }
       }
       return false;
    }
};

int main() {
    Solution sol;
    vector<vector<int>> matrix = {{1,4,7,11,15},{2,5,8,12,19},{3,6,9,16,22},{10,13,14,17,24},{18,21,23,26,30}};
    int target = 5;
    cout << sol.searchMatrix(matrix, target);
}
#+end_src

#+RESULTS:
: 1

